let rub = prompt('Какую сумму вы хотите положить в банк?', 0);
	if (((rub % 10) === 1) && ((rub % 100) !== 11)) {
		alert('Ваша сумма в ' + rub + ' рубль успешно зачислена.');
	}
	if (((rub % 10) >= 2) && ((rub % 10) <= 4) && (((rub % 100) !== 11) && ((rub % 100) !== 12) && ((rub % 100) !== 13)) && ((rub % 100) !== 14))  {
		alert('Ваша сумма в ' + rub + ' рубля успешно зачислена.');
	}
	if (((rub % 10) >= 5) && ((rub % 10) <= 20) || ((rub % 10) === 0) || ((rub % 100) === 11) || ((rub % 100) === 12) || ((rub % 100) === 13) || ((rub % 100) === 14)) {
		alert('Ваша сумма в ' + rub + ' рублей успешно зачислена.');
	}
	